app/controllers/posts_controller.rb

  def index
    @posts = Post.search(params[:search], params[:page], sort_column + " " + sort_direction)
---
SELECT * FROM `posts` WHERE (title like '%%') ORDER BY title desc LIMIT 0, 2
SELECT count(*) AS count_all FROM `posts` WHERE (title like '%%')

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2011-12-03 13:49:00', 'First post', '', '2011-12-03 13:49:44')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2011-12-03 18:20:14', `title` = 'new post' WHERE `id` = 2